typo/app/controllers/admin/content_controller.rb

  def auto_complete_for_article_keywords
    @items = Tag.find_with_char params[:article][:keywords].strip
---
SELECT "tags".* FROM "tags" WHERE (name LIKE '%dfsgsdf%' ) ORDER BY name ASC

  def set_shortened_url
    # In a very short time, I'd like to have permalink modification generate a 301 redirect as well to
    # So I set this up the big way now

    return unless Redirect.find_by_to_path(@article.permalink_url).nil?

    red = Redirect.new
    red.from_path = red.shorten
    red.to_path = @article.permalink_url
    red.save
---
SELECT "redirects".* FROM "redirects" WHERE "redirects"."to_path" = 'http://localhost:3000/2012/03/12/foo' LIMIT 1
INSERT INTO "redirects" ("from_path", "to_path", "origin", "created_at", "updated_at") VALUES ('oM6Ivw', 'http://localhost:3000/2012/03/12/foo', NULL, '2012-03-12 01:21:36.382452', '2012-03-12 01:21:36.382452')