hw2/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13', 'R') ORDER BY release_date
---
  def index
    # if the session has something :to_remember and neither the Refresh button
    # not a sort were requested, then it cannot be the first time you are coming
    # to the website. In this case, redirect_to a movies_path with the rememberd
    # params and remove the :to_remember from session.
    if session.has_key?(:to_remember) and
        !(params.has_key?(:commit) or params.has_key?(:sort_by))
      flash[:notice] = flash[:notice]
      redirect_to movies_path(session[:to_remember])
    end

    # ASSUMING that if redirect_to was reached, then you won't get to this part
    # of the program, you need to delete the :to_remember key from the session
    session.delete(:to_remember)

    @sort_type = params[:sort_by] # get what column to sort by

    # get all the ratings that have been checked
    # if no ratings were checked, ratings_chckd will be {}
    ratings_chckd = Hash.new
    ratings_chckd = params[:ratings].select{|k, v| v=="true"} unless
      params[:ratings] == nil

    # obtain all the ratings using Movie.all_ratings and set all to true
    @all_ratings = Hash.new
    Movie.all_ratings.each { |r| @all_ratings[r] = true }