app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'R') ORDER BY release_date
---
  def index
    # use :ratings to set up all the ratings that have been checked

    if params[:ratings] == nil
      ratings_chckd = {}
    else
      ratings_chckd = params[:ratings].select{|k, v| v=="1" or v=="true"}
    end

    @all_ratings = Hash.new
    Movie.all_ratings.each do |r|